SPARK DataFrames Basics

In [1]:
import findspark
findspark.init()

In [2]:
from pyspark.sql import SparkSession

In [3]:
from pyspark.sql.functions import regexp_extract

In [25]:
from pyspark.sql.functions import col, substring, regexp_replace

In [26]:
from pyspark.sql.types import IntegerType

In [5]:
import pyspark.sql.functions as f

In [6]:
spark=SparkSession.builder.appName('Basics').getOrCreate()

#### Reading Dataset

In [9]:
df=spark.read.csv('SalaryDataset.csv',header=True)

In [10]:
df.show()

+--------------------+--------------+-----------------+---------+-------------+
|        Company Name|     Job Title|Salaries Reported| Location|       Salary|
+--------------------+--------------+-----------------+---------+-------------+
|            Mu Sigma|Data Scientist|              105|Bangalore| ₹6,48,573/yr|
|                 IBM|Data Scientist|               95|Bangalore|₹11,91,950/yr|
|Tata Consultancy ...|Data Scientist|               66|Bangalore| ₹8,36,874/yr|
|    Impact Analytics|Data Scientist|               40|Bangalore| ₹6,69,578/yr|
|           Accenture|Data Scientist|               32|Bangalore| ₹9,44,110/yr|
|             Infosys|Data Scientist|               30|Bangalore| ₹9,08,764/yr|
|           Capgemini|Data Scientist|               28|Bangalore| ₹9,26,124/yr|
|Cognizant Technol...|Data Scientist|               26|Bangalore| ₹7,36,708/yr|
|Anheuser-Busch InBev|Data Scientist|               25|Bangalore|₹16,46,721/yr|
|             Fractal|Data Scientist|               22|Bangalore|₹13,92,960/yr|
|              Embibe|Data Scientist|               20|Bangalore|₹14,04,773/yr|
|              Amazon|Data Scientist|               19|Bangalore|₹15,07,343/yr|
|              Google|Data Scientist|               19|Bangalore|₹15,58,095/yr|
|            Flipkart|Data Scientist|               18|Bangalore|₹25,57,843/yr|
|             HP Inc.|Data Scientist|               16|Bangalore|₹15,10,081/yr|
|               Wipro|Data Scientist|               15|Bangalore| ₹7,32,821/yr|
|  Ericsson-Worldwide|Data Scientist|               15|Bangalore|₹12,21,750/yr|
|                 MiQ|Data Scientist|               15|Bangalore|₹17,39,484/yr|
|            Deloitte|Data Scientist|               14|Bangalore|₹11,24,939/yr|
|           Microsoft|Data Scientist|               14|Bangalore|₹16,30,396/yr|
+--------------------+--------------+-----------------+---------+-------------+
only showing top 20 rows

#### Summarizing and Cleaning Dataset

In [11]:
df.columns

['Company Name', 'Job Title', 'Salaries Reported', 'Location', 'Salary']

In [12]:
df.printSchema()

root
 |-- Company Name: string (nullable = true)
 |-- Job Title: string (nullable = true)
 |-- Salaries Reported: string (nullable = true)
 |-- Location: string (nullable = true)
 |-- Salary: string (nullable = true)

In [13]:
df=df.withColumnRenamed('Company Name','Company_Name')

In [14]:
df=df.withColumnRenamed('Job Title','Job_Title')

In [15]:
df=df.withColumnRenamed('Salaries Reported','Salaries_Reported')

In [16]:
df=df.na.drop()

#### Salary Column Cleanup

In [17]:
df=df.withColumn("salary",regexp_replace("salary",",",""))

In [18]:
df=df.withColumn("Currency",regexp_extract("salary",'(\D+)',1))

In [19]:
df=df.withColumn("Amount",regexp_extract("salary",'(\\D+)(\\w+)',2))

In [20]:
df=df.withColumn("Period",substring(df['salary'], -2, 2))

In [21]:
df.show()

+--------------------+--------------+-----------------+---------+-----------+--------+-------+------+
|        Company_Name|     Job_Title|Salaries_Reported| Location|     salary|Currency| Amount|Period|
+--------------------+--------------+-----------------+---------+-----------+--------+-------+------+
|            Mu Sigma|Data Scientist|              105|Bangalore| ₹648573/yr|       ₹| 648573|    yr|
|                 IBM|Data Scientist|               95|Bangalore|₹1191950/yr|       ₹|1191950|    yr|
|Tata Consultancy ...|Data Scientist|               66|Bangalore| ₹836874/yr|       ₹| 836874|    yr|
|    Impact Analytics|Data Scientist|               40|Bangalore| ₹669578/yr|       ₹| 669578|    yr|
|           Accenture|Data Scientist|               32|Bangalore| ₹944110/yr|       ₹| 944110|    yr|
|             Infosys|Data Scientist|               30|Bangalore| ₹908764/yr|       ₹| 908764|    yr|
|           Capgemini|Data Scientist|               28|Bangalore| ₹926124/yr|       ₹| 926124|    yr|
|Cognizant Technol...|Data Scientist|               26|Bangalore| ₹736708/yr|       ₹| 736708|    yr|
|Anheuser-Busch InBev|Data Scientist|               25|Bangalore|₹1646721/yr|       ₹|1646721|    yr|
|             Fractal|Data Scientist|               22|Bangalore|₹1392960/yr|       ₹|1392960|    yr|
|              Embibe|Data Scientist|               20|Bangalore|₹1404773/yr|       ₹|1404773|    yr|
|              Amazon|Data Scientist|               19|Bangalore|₹1507343/yr|       ₹|1507343|    yr|
|              Google|Data Scientist|               19|Bangalore|₹1558095/yr|       ₹|1558095|    yr|
|            Flipkart|Data Scientist|               18|Bangalore|₹2557843/yr|       ₹|2557843|    yr|
|             HP Inc.|Data Scientist|               16|Bangalore|₹1510081/yr|       ₹|1510081|    yr|
|               Wipro|Data Scientist|               15|Bangalore| ₹732821/yr|       ₹| 732821|    yr|
|  Ericsson-Worldwide|Data Scientist|               15|Bangalore|₹1221750/yr|       ₹|1221750|    yr|
|                 MiQ|Data Scientist|               15|Bangalore|₹1739484/yr|       ₹|1739484|    yr|
|            Deloitte|Data Scientist|               14|Bangalore|₹1124939/yr|       ₹|1124939|    yr|
|           Microsoft|Data Scientist|               14|Bangalore|₹1630396/yr|       ₹|1630396|    yr|
+--------------------+--------------+-----------------+---------+-----------+--------+-------+------+
only showing top 20 rows

In [22]:
df.describe().show()

+-------+---------------+--------------------+-----------------+---------+----------+--------+-----------------+------+
|summary|   Company_Name|           Job_Title|Salaries_Reported| Location|    salary|Currency|           Amount|Period|
+-------+---------------+--------------------+-----------------+---------+----------+--------+-----------------+------+
|  count|           4339|                4339|             4339|     4339|      4339|    4339|             4339|  4339|
|   mean|           null|                null|2.777137589306292|     null|      null|    null|768070.9638165475|  null|
| stddev|           null|                null|5.148094762075859|     null|      null|    null|769002.4850658625|  null|
|    min|& Other Stories|Associate Machine...|                1|Bangalore|$100488/yr|       $|              100|    hr|
|    max|Águas Guariroba|Software Engineer...|               95|     Pune|₹999998/yr|       ₹|           999998|    yr|
+-------+---------------+--------------------+-----------------+---------+----------+--------+-----------------+------+

In [27]:
df=df.withColumn("Amount",df["Amount"].cast(IntegerType()))

In [28]:
df=df.withColumn('Salary_INR',f.when(f.col('Currency')=='$',f.col('Amount')*82).when(f.col('Currency')=='£',f.col('Amount')*102).when(f.col('Currency')=='AFN',f.col('Amount')*0.94).otherwise(f.col('Amount')))

In [29]:
df=df.withColumn('Salary_INR',f.when(f.col('Period')=='hr',f.col('Salary_INR')*160).otherwise(f.col('Salary_INR')))

In [30]:
df=df.withColumn('Salary_INR',f.when(f.col('Period')=='mo',f.col('Salary_INR')*12).otherwise(f.col('Salary_INR')))

In [31]:
df.select('Currency').distinct().show()

+--------+
|Currency|
+--------+
|       ₹|
|    AFN |
|       $|
|       £|
+--------+

In [33]:
df.select('Salary_INR').show(100)

+----------+
|Salary_INR|
+----------+
|  648573.0|
| 1191950.0|
|  836874.0|
|  669578.0|
|  944110.0|
|  908764.0|
|  926124.0|
|  736708.0|
| 1646721.0|
| 1392960.0|
| 1404773.0|
| 1507343.0|
| 1558095.0|
| 2557843.0|
| 1510081.0|
|  732821.0|
| 1221750.0|
| 1739484.0|
| 1124939.0|
| 1630396.0|
| 1009436.0|
|  550980.0|
| 1870000.0|
|  758376.0|
| 1556575.0|
| 1194327.0|
| 1470000.0|
| 1549942.0|
| 1009436.0|
| 1541572.0|
|  811182.0|
| 1205874.0|
|  727111.0|
| 1923257.0|
| 2143501.0|
| 1926965.0|
|  495252.0|
| 1294984.0|
| 2334960.0|
| 2267616.0|
| 1366992.0|
| 1453427.0|
| 1458032.0|
| 1730166.0|
|  658109.0|
|  794460.0|
| 2567381.0|
| 1637231.0|
|  900000.0|
|  902935.0|
|  970782.0|
| 1050000.0|
| 2119584.0|
| 1687111.0|
| 1465641.0|
|  600000.0|
| 1805869.0|
| 2624063.0|
|  955297.0|
|  761478.0|
| 2805476.0|
|  969112.0|
|  450979.0|
| 1338795.0|
| 1040493.0|
| 1291549.0|
|  599136.0|
| 1663189.0|
| 1323387.0|
| 1246266.0|
|  494147.0|
| 1892758.0|
| 1572054.0|
| 2024533.0|
| 1927564.0|
|  800000.0|
| 2009790.0|
|  831462.0|
|  516323.0|
| 2333241.0|
| 1200000.0|
| 2006522.0|
| 2160000.0|
| 1341316.0|
| 1634105.0|
| 1389256.0|
| 1000000.0|
| 1231116.0|
| 2352941.0|
|  744551.0|
| 3014686.0|
| 1357204.0|
| 1053196.0|
| 1337606.0|
|  585900.0|
|  395436.0|
| 1649930.0|
| 1138060.0|
| 1612744.0|
|  432776.0|
+----------+
only showing top 100 rows